/*
⚠️ PERINGATAN:
Script ini **TIDAK BOLEH DIPERJUALBELIKAN** dalam bentuk apa pun!

╔══════════════════════════════════════════════╗
║                🛠️ INFORMASI SCRIPT           ║
╠══════════════════════════════════════════════╣
║ 📦 Version   : 4.2.6
║ 👨‍💻 Developer  : Azhari Creative              ║
║ 🌐 Website    : https://autoresbot.com       ║
║ 💻 GitHub  : github.com/autoresbot/resbot-md ║
╚══════════════════════════════════════════════╝

📌 Mulai 11 April 2025,
Script **Autoresbot** resmi menjadi **Open Source** dan dapat digunakan secara gratis:
🔗 https://autoresbot.com
*/

const mess = {
  game: {
    isPlaying: `╭─〔 ᴘᴇʀᴍᴀɪɴᴀɴ ꜱᴇᴅᴀɴɢ ʙᴇʀʟᴀɴɢꜱᴜɴɢ 〕
│ ⚠️ ᴍᴏʜᴏɴ ꜱᴀʙᴀʀ, ᴘᴇʀᴍᴀɪɴᴀɴ ʟᴀɪɴ ᴛᴇʟᴀʜ ᴅɪᴍᴜʟᴀɪ
│ ᴋᴇᴛɪᴋ *ɴʏᴇʀᴀʜ* ᴜɴᴛᴜᴋ ᴍᴇɴʏᴇʟᴇꜱᴀɪᴋᴀɴ
╰───────────────`,
    isGroup: `╭─〔 ᴍᴏᴅᴇ ɢʀᴜᴘ ᴅɪʙᴜᴋᴀ 〕
│ ⚠️ ɢᴀᴍᴇ ɪɴɪ ʜᴀɴʏᴀ ʙɪꜱᴀ ᴅɪᴍᴀɪɴᴋᴀɴ ᴅɪ ɢʀᴜᴘ
╰───────────────`,
    isStop: `╭─〔 ғɪᴛᴜʀ ɢᴀᴍᴇ ᴅɪᴍᴀᴛɪᴋᴀɴ 〕
│ ⚠️ ғɪᴛᴜʀ ɪɴɪ ꜱᴇᴅᴀɴɢ ᴛɪᴅᴀᴋ ᴀᴋᴛɪғ
│ ʜᴜʙᴜɴɢɪ ᴀᴅᴍɪɴ ᴜɴᴛᴜᴋ ᴀᴋᴛɪꜰᴋᴀɴ
╰───────────────`
  },
    general: {
    isOwner: `╭─〔 ʜᴀɴʏᴀ ᴏᴡɴᴇʀ 〕
│ ⚠️ ᴘᴇʀɪɴᴛᴀʜ ɪɴɪ ᴋʜᴜꜱᴜꜱ ᴜɴᴛᴜᴋ ᴏᴡɴᴇʀ ʙᴏᴛ
╰───────────────`,
    isPremium: `╭─〔 ᴜꜱᴇʀ ᴘʀᴇᴍɪᴜᴍ 〕
│ ⚠️ ʜᴀɴʏᴀ ᴘᴇɴɢɢᴜɴᴀ ᴘʀᴇᴍɪᴜᴍ ʏᴀɴɢ ʙɪꜱᴀ ᴀᴋꜱᴇꜱ
╰───────────────`,
    isAdmin: `╭─〔 ᴀᴅᴍɪɴ ꜰɪᴛᴜʀ 〕
│ ⚠️ ᴘᴇʀɪɴᴛᴀʜ ɪɴɪ ᴋʜᴜꜱᴜꜱ ᴜɴᴛᴜᴋ ᴀᴅᴍɪɴ ɢʀᴜᴘ
╰───────────────`,
    isGroup: `╭─〔 ᴍᴏᴅᴇ ɢʀᴜᴘ 〕
│ ⚠️ ᴘᴇʀɪɴᴛᴀʜ ɪɴɪ ʜᴀɴʏᴀ ʙɪꜱᴀ ᴅɪᴘᴀᴋᴀɪ ᴅɪ ɢʀᴜᴘ
╰───────────────`,
    limit: `╭─〔 ʟɪᴍɪᴛ ʜᴀʙɪꜱ 〕
│ ⚠️ ᴋᴀᴍᴜ ꜱᴜᴅᴀʜ ᴍᴇɴᴄᴀᴘᴀɪ ʙᴀᴛᴀꜱ
│ ᴋᴇᴛɪᴋ *.ᴄʟᴀɪᴍ* ᴜɴᴛᴜᴋ ᴍᴇɴᴀᴍʙᴀʜ ʟɪᴍɪᴛ
╰───────────────`,
    success: `╭─〔 ꜱᴜᴋꜱᴇꜱ 〕
│ ✅ ᴘᴇʀɪɴᴛᴀʜ ʙᴇʀʜᴀꜱɪʟ
╰───────────────`,
    isBlocked: `╭─〔 ᴀᴋᴜɴ ᴅɪʙʟᴏᴄᴋ 〕
│ ⚠️ ᴋᴀᴍᴜ ᴛᴇʟᴀʜ ᴅɪʙʟᴏᴄᴋ ᴅᴀʀɪ ʙᴏᴛ
╰───────────────`,
    isBaned: `╭─〔 ᴅɪʙᴀɴ ᴅɪ ɢʀᴜᴘ 〕
│ ⚠️ ᴋᴀᴍᴜ ᴛɪᴅᴀᴋ ʙɪꜱᴀ ᴍᴇɴɢɢᴜɴᴀᴋᴀɴ ʙᴏᴛ ᴅɪ ɢʀᴜᴘ ɪɴɪ
╰───────────────`,
    fiturBlocked: `╭─〔 ꜰɪᴛᴜʀ ᴅɪʙᴀɴ 〕
│ ⚠️ ꜰɪᴛᴜʀ ɪɴɪ ꜱᴇᴅᴀɴɢ ᴛɪᴅᴀᴋ ᴀᴋᴛɪꜰ ᴅɪ ɢʀᴜᴘ
╰───────────────`
  },
    action: {
    grub_open: `╭─〔 ɢʀᴜᴘ ᴅɪʙᴜᴋᴀ 〕
│ 🔓 ɢʀᴜᴘ ʙᴇʀʜᴀꜱɪʟ ᴅɪʙᴜᴋᴀ
╰───────────────`,
    grub_close: `╭─〔 ɢʀᴜᴘ ᴅɪᴛᴜᴛᴜᴘ 〕
│ 🔒 ɢʀᴜᴘ ʙᴇʀʜᴀꜱɪʟ ᴅɪᴛᴜᴛᴜᴘ
╰───────────────`,
    user_kick: `╭─〔 ᴘᴇɴɢᴜꜱɪʀᴀɴ ᴀɴɢɢᴏᴛᴀ 〕
│ ✅ _ʙᴇʀʜᴀꜱɪʟ ᴍᴇɴɢᴇʟᴜᴀʀᴋᴀɴ ᴘᴇꜱᴇʀᴛᴀ_
╰───────────────`,
    mute: `╭─〔 ɢʀᴜᴘ ᴅɪ-ᴍᴜᴛᴇ 〕
│ 🔇 ꜱᴇᴍᴜᴀ ᴘᴇʀɪɴᴛᴀʜ ᴅɪɴᴏɴᴀᴋᴛɪꜰᴋᴀɴ
╰───────────────`,
    unmute: `╭─〔 ɢʀᴜᴘ ᴅɪ-ᴜɴᴍᴜᴛᴇ 〕
│ 🔈 ꜱᴇᴍᴜᴀ ꜰɪᴛᴜʀ ᴋᴇᴍʙᴀʟɪ ᴀᴋᴛɪꜰ
╰───────────────`,
    resetgc: `╭─〔 ʀᴇꜱᴇᴛ ʟɪɴᴋ ɢʀᴜᴘ 〕
│ ♻️ ʟɪɴᴋ ʙᴀʀᴜ ᴛᴇʟᴀʜ ᴅɪʙᴜᴀᴛ
╰───────────────`
  },
    handler: {
    badword_warning: `╭─〔 ʙᴀᴅᴡᴏʀᴅ ᴅᴇᴛᴇᴋꜱɪ 〕
│ ⚠️ @sender ᴍᴇɴɢɪʀɪᴍ: @detectword
│ ᴘᴇʀɪɴɢᴀᴛᴀɴ: @warning/@totalwarning
╰───────────────`,
    badword_block: `╭─〔 ᴅɪʙʟᴏᴋɪʀ: ʙᴀᴅᴡᴏʀᴅ 〕
│ ⛔ @sender ᴛᴇʟᴀʜ ᴅɪʙʟᴏᴋɪʀ ᴋᴀʀᴇɴᴀ @detectword
╰───────────────`,
    antiedit: `╭─〔 ᴀɴᴛɪ ᴇᴅɪᴛ 〕
│ ✏️ ᴘᴇꜱᴀɴ sᴇʙᴇʟᴜᴍɴʏᴀ: @oldMessage
╰───────────────`,
    antidelete: `╭─〔 ᴀɴᴛɪ ʜᴀᴘᴜꜱ 〕
│ 🗑️ ᴘᴇꜱᴀɴ: @text
│ ᴘᴇɴɢɪʀɪᴍ: @sender
╰───────────────`,
    antispamchat: `╭─〔 ꜱᴘᴀᴍ ᴅɪᴅᴇᴛᴇᴋꜱɪ 〕
│ ⚠️ @sender ꜱᴘᴀᴍ: @warning/@totalwarning
╰───────────────`,
    antispamchat2: `╭─〔 ᴅɪʙʟᴏᴋɪʀ: ꜱᴘᴀᴍ 〕
│ ⛔ @sender ᴛᴇʟᴀʜ ᴅɪʙʟᴏᴋɪʀ ᴋᴀʀᴇɴᴀ ꜱᴘᴀᴍ
╰───────────────`,
    antivirtex: `╭─〔 ᴠɪʀᴛᴇx ᴅɪᴅᴇᴛᴇᴋꜱɪ 〕
│ ⚠️ @sender ᴍᴇɴɢɪʀɪᴍ ᴠɪʀᴛᴇx
╰───────────────`,
    antitagsw: `╭─〔 ᴛᴀɢ ꜱᴛᴏʀʏ ᴅɪʟᴀʀᴀɴɢ 〕
│ ⚠️ @sender ᴛᴇʀᴅᴇᴛᴇᴋꜱɪ
╰───────────────`,
    antibot: `╭─〔 ʙᴏᴛ ᴅᴇᴛᴇᴋᴛɪ 〕
│ ⚠️ @sender ᴛᴇʀɪɴᴅɪᴋᴀꜱɪ ʙᴏᴛ
╰───────────────`,
    afk: `╭─〔 ᴀғᴋ ᴍᴏᴅᴇ 〕
│ 🚫 @sender ᴀғᴋ ꜱᴇᴊᴀᴋ *@durasi*
│ @alasan
╰───────────────`,
    afk_message: `╭─〔 ᴋᴇᴍʙᴀʟɪ ᴅᴀʀɪ ᴀғᴋ 〕
│ 🕊️ @sender ᴛᴇʟᴀʜ ᴀᴋᴛɪꜰ ᴋᴇᴍʙᴀʟɪ
│
│ ᴅᴜʀᴀꜱɪ: *@durasi*@alasan
╰───────────────`,
    sewa_notif: `╭─〔 ꜱᴇᴡᴀ ʙᴏᴛ ᴘᴇʀɪɴɢᴀᴛᴀɴ 〕
│ ⚠️ ᴍᴀꜱᴀ ꜱᴇᴡᴀ ʙᴏᴛ ʙᴇʀᴀᴋʜɪʀ ᴘᴀᴅᴀ @date
╰───────────────`,
    sewa_out: `╭─〔 ꜱᴇᴡᴀ ʙᴇʀᴀᴋʜɪʀ 〕
│ ❌ ᴛᴇʀɪᴍᴀ ᴋᴀꜱɪʜ ᴛᴇʟᴀʜ ᴍᴇɴʏᴇᴡᴀ
│ Owner: wa.me/@ownernumber
╰───────────────`
  },
    game_handler: {
    menyerah: `╭─〔 ᴋᴀᴍᴜ ᴍᴇɴʏᴇʀᴀʜ 〕
│ 🧩 ᴊᴀᴡᴀʙᴀɴ: @answer
│ ᴋᴇᴛɪᴋ *@command* ᴜɴᴛᴜᴋ ʙᴇʀᴍᴀɪɴ ʟᴀɢɪ
╰───────────────`,
    waktu_habis: `╭─〔 ᴡᴀᴋᴛᴜ ʜᴀʙɪꜱ 〕
│ ⏳ ᴊᴀᴡᴀʙᴀɴ: @answer
╰───────────────`,
    tebak_angka: `╭─〔 ᴛᴇʙᴀᴋ ᴀɴɢᴋᴀ 〕
│ 🎉ʙᴇɴᴀʀ ᴋᴀᴍᴜ ᴍᴇɴᴅᴀᴘᴀᴛᴋᴀɴ ᴍᴏɴᴇʏ : @hadiah
╰───────────────`,
    tebak_bendera: `╭─〔 ᴛᴇʙᴀᴋ ʙᴇɴᴅᴇʀᴀ 〕
│ 🎉ʙᴇɴᴀʀ ᴋᴀᴍᴜ ᴍᴇɴᴅᴀᴘᴀᴛᴋᴀɴ ᴍᴏɴᴇʏ: @hadiah
╰───────────────`,
    tebak_gambar: `╭─〔 ᴛᴇʙᴀᴋ ɢᴀᴍʙᴀʀ 〕
│ 🎉ʙᴇɴᴀʀ ᴋᴀᴍᴜ ᴍᴇɴᴅᴀᴘᴀᴛᴋᴀɴ ᴍᴏɴᴇʏ: @hadiah
╰───────────────`,
    tebak_hewan: `╭─〔 ᴛᴇʙᴀᴋ ʜᴇᴡᴀɴ 〕
│ 🎉ʙᴇɴᴀʀ ᴋᴀᴍᴜ ᴍᴇɴᴅᴀᴘᴀᴛᴋᴀɴ ᴍᴏɴᴇʏ: @hadiah
╰───────────────`,
    tebak_kalimat: `╭─〔 ᴛᴇʙᴀᴋ ᴋᴀʟɪᴍᴀᴛ 〕
│ 🎉ʙᴇɴᴀʀ ᴋᴀᴍᴜ ᴍᴇɴᴅᴀᴘᴀᴛᴋᴀɴ ᴍᴏɴᴇʏ: @hadiah
╰───────────────`,
    tebak_kata: `╭─〔 ᴛᴇʙᴀᴋ ᴋᴀᴛᴀ 〕
│ 🎉ʙᴇɴᴀʀ ᴋᴀᴍᴜ ᴍᴇɴᴅᴀᴘᴀᴛᴋᴀɴ ᴍᴏɴᴇʏ: @hadiah
╰───────────────`,
    tebak_lagu: `╭─〔 ᴛᴇʙᴀᴋ ʟᴀɢᴜ 〕
│ ✅ ʏᴀɪᴛᴜ ʟᴀɢᴜ ʏᴀɴɢ ᴛᴇᴘᴀᴛ!
│ 💰 ʜᴀᴅɪᴀʜ: @hadiah
╰───────────────`,
    tebak_lirik: `╭─〔 ᴛᴇʙᴀᴋ ʟɪʀɪᴋ 〕
│ ✅ ᴊᴀᴡᴀʙᴀɴ ʟɪʀɪᴋ ᴋᴀᴍᴜ ʙᴇɴᴀʀ!
│ 💰 ʜᴀᴅɪᴀʜ: @hadiah
╰───────────────`
  }
};

// Variable
global.group = {};
global.group.variable = `
☍ @name
☍ @date
☍ @day
☍ @desc
☍ @group
☍ @greeting
☍ @size
☍ @time`;

module.exports = mess;